In [17]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
import sys

df1 = pd.DataFrame({
    'name' : ['NaT',"Fai'l'", 'EXE', None, 'FAIL'],
    'time' : ['', datetime.now(),datetime.now(), datetime.now(),datetime.now()],
    'gender' : [1, 23, 23, 32,21]},
    columns=['name', 'time', 'gender'])
df2 = pd.DataFrame({
    'name' : ['aa', 'bb', 'cc', 'dd', 'ee'],
    'bb' : [10.222, 235344, 235.44, 423.3223, 35.353],
    'cc' : [1, 3523, 25313, 3532,2135],
    'dd' : [11, 22, 33, 44, 55],
    'ee' : [66, 77, 88, 99,10]},
    columns=['name', 'bb', 'cc','dd','ee'])
print df1
df1.iloc[:,0:].values

     name                       time  gender
0     NaT                        NaT       1
1  Fai'l' 2019-04-04 12:26:38.558224      23
2     EXE 2019-04-04 12:26:38.558248      23
3    None 2019-04-04 12:26:38.558252      32
4    FAIL 2019-04-04 12:26:38.558255      21

array([['NaT', NaT, 1],
       ["Fai'l'", Timestamp('2019-04-04 12:26:38.558224'), 23],
       ['EXE', Timestamp('2019-04-04 12:26:38.558248'), 23],
       [None, Timestamp('2019-04-04 12:26:38.558252'), 32],
       ['FAIL', Timestamp('2019-04-04 12:26:38.558255'), 21]],
      dtype=object)

In [108]:
            #3                    #1                       #2
st = [datetime.now() - timedelta(2), datetime.now(), datetime.now() - timedelta(1)]
# st = 2date
# rep = r2
rep = ['r1','r2','r3']
#print st
#print rep
key_value = dict(zip(st, rep))
dd = sorted(key_value.items(), key = lambda kv:kv[0])
print dd
print dd[-1][-1] # rep
print dd[0][0] # st time

[(datetime.datetime(2019, 4, 2, 15, 3, 11, 245083), 'r1'), (datetime.datetime(2019, 4, 3, 15, 3, 11, 245138), 'r3'), (datetime.datetime(2019, 4, 4, 15, 3, 11, 245130), 'r2')]
r2
2019-04-02 15:03:11.245083

In [36]:
print df1
df1['name'] = df1['name'].replace('NaT', '')
print df1['name'][0]
type(df1['name'][0])

     name                       time  gender
0     NaT                        NaT       1
1  Fai'l' 2019-03-26 12:13:30.179413      23
2     EXE 2019-03-26 12:13:30.179438      23
3    None 2019-03-26 12:13:30.179444      32
4    FAIL 2019-03-26 12:13:30.179449      21

str

In [33]:
ll = ['a','b']
s = 's'
print "'{}, {}' is a, '{}' is b".format(s, *ll)

's, a' is a, 'b' is b

In [82]:
df1['name'] = df1['name'].str.replace("'", '"')
df1

     name                       time  gender
0    None                        NaT       1
1  Fai"l" 2019-03-14 18:23:16.520415      23
2     EXE 2019-03-14 18:23:16.520434      23
3    None 2019-03-14 18:23:16.520442      32
4    FAIL 2019-03-14 18:23:16.520447      21

In [93]:
dd = '2019-03-14 18:28:32 AM'
dd.split('.')

['2019-03-14 18:28:32 AM']

In [32]:
df1.set_index('name', inplace=True)

In [2]:
df2.set_index('name', inplace=True)
df2

               bb     cc  dd  ee
name
aa        10.2220      1  11  66
bb    235344.0000   3523  22  77
cc       235.4400  25313  33  88
dd       423.3223   3532  44  99
ee        35.3530   2135  55  10

In [2]:
df1

  name                       time  gender
0   aa                        NaT       1
1   bb 2019-02-28 18:06:30.495809      23
2   cc 2019-02-28 18:06:30.495822      23
3   dd 2019-02-28 18:06:30.495824      32
4   ee 2019-02-28 18:06:30.495826      21

In [3]:
df2

  name           bb     cc  dd  ee
0   aa      10.2220      1  11  66
1   bb  235344.0000   3523  22  77
2   cc     235.4400  25313  33  88
3   dd     423.3223   3532  44  99
4   ee      35.3530   2135  55  10

In [4]:
df = df1.merge(df2, on=['name'])
df

  name                       time  gender           bb     cc  dd  ee
0   aa                        NaT       1      10.2220      1  11  66
1   bb 2019-03-14 13:57:51.321634      23  235344.0000   3523  22  77
2   cc 2019-03-14 13:57:51.321707      23     235.4400  25313  33  88
3   dd 2019-03-14 13:57:51.321713      32     423.3223   3532  44  99
4   ee 2019-03-14 13:57:51.321730      21      35.3530   2135  55  10

In [8]:
ll = [[[1,2],[3,4]],[[1,2],[3,4]]]
[y for x in ll for y in x]

[[1, 2], [3, 4], [1, 2], [3, 4]]

In [64]:
list(df1['name'].append(pd.Series(['ll'])))

['aa', 'bb', 'cc', 'dd', 'ee', 'll']

In [49]:
#df1['time'] = pd.to_datetime(df1['time'])
df1.sort_values(by=['time'], ascending=False)

  name                       time  gender
4   ee 2019-02-14 14:47:17.889537      21
3   dd 2019-02-14 14:47:17.889533      32
2   cc 2019-02-14 14:47:17.889529      23
1   bb 2019-02-14 14:47:17.889523      23
0   aa 2019-02-14 14:47:17.889494       1

In [26]:
if 'aa' in list(df1['name']):
    sub_df = df1[df1['name'] == 'aa'][['age','gender']]
sub_df.iloc[0]['age']

10.222

In [6]:
df1.set_index('name', inplace=True)
len(df1)

5

In [7]:
df2.set_index('name', inplace=True)
df2

KeyError: 'name'

In [8]:
df = pd.concat([df1,df2[['age','gender']]])
df

KeyError: "['age' 'gender'] not in index"

In [120]:
df.drop_duplicates(['age','gender'], inplace=True)
df

              age  gender
name
aa        10.2220       1
bb        22.3440      23
cc        33.4400      23
dd        44.3223      32
ee        77.3530      21
BB    235344.0000    3523
CC       235.4400   25313
DD       423.3223    3532
EE        35.3530    2135

In [121]:
dd = df[~df.index.isin(df1.index)]
dd

              age  gender
name
BB    235344.0000    3523
CC       235.4400   25313
DD       423.3223    3532
EE        35.3530    2135

In [123]:
dd.reset_index(inplace=True)

In [125]:
df2.reset_index(inplace=True)

In [124]:
l1 = dd.values.tolist()
l1

[['BB', 235344.0, 3523],
 ['CC', 235.44, 25313],
 ['DD', 423.3223, 3532],
 ['EE', 35.353, 2135]]

In [126]:
l2 = df2.values.tolist()
l2

[['AA', 10.222, 1, 11, 66],
 ['BB', 235344.0, 3523, 22, 77],
 ['CC', 235.44, 25313, 33, 88],
 ['DD', 423.3223, 3532, 44, 99],
 ['EE', 35.353, 2135, 55, 10]]

In [24]:
dd

NameError: name 'dd' is not defined

In [145]:
df2[df2['name'].isin(list(dd['name']))][['name','age1','gender1']]

  name  age1  gender1
1   BB    22       77
2   CC    33       88
3   DD    44       99
4   EE    55       10

In [64]:
d1 = df1[df1['name'].isin(['aa','bb'])].iloc[:,1:]
d1['time'] = d1['time'].apply(lambda x: x.strftime('%m/%d/%Y %r') if not x is pd.NaT else x)
d = d1.values
['-a-'.join(filter(pd.NaT,data)) for data in d]

TypeError: 'NaTType' object is not callable

In [90]:
for i in df1['name']:
    if list(df1['name']).index(i)==0:
        print 'ok'
    else:
        print 'pp'

ok
pp
pp
pp
pp

In [69]:
df1.pivot(index='name', columns='age', values='gender')

age   10.2220  22.3440  33.4400  44.3223  77.3530
name
AA        1.0      NaN      NaN      NaN      NaN
CC        NaN      NaN     23.0      NaN      NaN
DD        NaN      NaN      NaN     32.0      NaN
EE        NaN      NaN      NaN      NaN     21.0
bb        NaN     23.0      NaN      NaN      NaN

In [45]:
df1.merge(df2, on='name')

  name      age  gender           aa     bb
0   AA  10.2220       1    1153.4300    135
1   bb  22.3440      23     235.4400  25313
2   CC  33.4400      23  235344.0000   3523
3   DD  44.3223      32     423.3223   3532
4   EE  77.3530      21      35.3530   2135

In [25]:
for i, r in df1.iterrows():
    ll.append((r['name'], r['age']))
    
ll

[('AA', 10.222),
 ('bb', 22.344),
 ('CC', 33.44),
 ('DD', 44.3223),
 ('EE', 77.353)]

In [53]:
v = df1.loc[df1['name'].isin(ll)]

In [57]:
v

  name     age  gender
0   AA  10.222       1
2   CC  33.440      23

In [60]:
for i ,r in v.iterrows():
    print r['age']

10.222
33.44

In [216]:
df1.set_index('name', inplace=True)

In [219]:
list(df1.index).replace("","")

['AA', 'AA', 'CC', 'DD', 'EE']

# del df1['name'], df1['age']
df1.drop(['name','age'],axis=1,inplace=True)
df1

In [171]:
ll = ['XX','AA','XX','GG','HH','ss']
df1['test'] = df1['name'].isin(ll)
df1['test'].replace([True, False], ['yes','no'], inplace=True)
df1

  name      age  gender test
0   AA  10.2220       1  yes
1   AA  22.3440      23  yes
2   CC  33.4400      23   no
3   DD  44.3223      32   no
4   EE  77.3530      21   no

In [206]:
map(lambda x,y: max(x,y), df1['gender'], df1['age'])

[10.222, 23, 33.44, 44.3223, 77.353]

In [211]:
t1 = pd.Series([1-t])

In [207]:
t = -df1['gender']

In [210]:
pd.concat(-t.diff())

name
AA     NaN
AA   -22.0
CC    -0.0
DD    -9.0
EE    11.0
Name: gender, dtype: float64

In [82]:
df1['name']=df1['name'].apply(lambda x: x+"aa")

In [89]:
tuple(df1['name'], df1['age'])

TypeError: tuple() takes at most 1 argument (2 given)

In [210]:
for i in df1['name'].loc[usd]:
    print i

AA
DD

In [26]:
df1['name'][1:len(df1['name'])].isin(ll)

NameError: name 'll' is not defined

In [158]:
df1['name'][(df1['name']=='AA') | (df1['age']==10.22)]

0    AA
Name: name, dtype: object

In [28]:
ll = ['AA','DD']
l1 = map(lambda x,y: x|y ,df1['name'][1:len(df1['name'])].isin(ll), df1['name'][:len(df1['name'])-1].isin(ll))
l1.insert(0,False)
l1

[False, True, False, True, True]

In [29]:
df1['name'] = df1['name'].map(lambda x: x.strip())
df1['name']

0    AA
1    BB
2    CC
3    DD
4    EE
Name: name, dtype: object

In [138]:
Prob = pd.Series([0]*7)
print Prob
SovVal = pd.Series([1,4,7,5])
print SovVal
SovProbs = pd.Series([0,'xx',0,0,'x','y','z','u','v'])
print SovProbs
SovIndex = pd.Series([1,1,1,0,0,1,0])
print SovIndex

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64
0    1
1    4
2    7
3    5
dtype: int64
0     0
1    xx
2     0
3     0
4     x
5     y
6     z
7     u
8     v
dtype: object
0    1
1    1
2    1
3    0
4    0
5    1
6    0
dtype: int64

In [140]:
j=0
for i in range(0,len(SovIndex)):
    if SovIndex[i]==1:
        #for j in SovVal:
        x = SovProbs.iloc[SovVal[j]]
        Prob.iloc[i] = x
        j=j+1
        
Prob

0    xx
1     x
2     u
3     0
4     0
5     y
6     0
dtype: object

In [31]:
len(df1.columns[1:])

2

In [199]:
df1.to_html()

u'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>name</th>\n      <th>age</th>\n      <th>gender</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>AA</td>\n      <td>10.22</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>BB</td>\n      <td>22.34</td>\n      <td>23</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>CC</td>\n      <td>33.44</td>\n      <td>23</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>DD</td>\n      <td>44.32</td>\n      <td>32</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>EE</td>\n      <td>77.35</td>\n      <td>21</td>\n    </tr>\n  </tbody>\n</table>'

In [162]:
df2 = pd.DataFrame({
    'name' : ['BB', 'AA', 'CC', 'DD'],
    'age' : ['BB', 10, 33, 44]},
    columns=['name', 'age'])

df2['color'] = "red"
df2

  name age color
0   BB  BB   red
1   AA  10   red
2   CC  33   red
3   DD  44   red

In [167]:
df2.query('color == name')

Empty DataFrame
Columns: [name, age, color]
Index: []

In [26]:
df2.loc[:,:]

  name  age color
0   BB   22   red
1   AA   10   red
2   CC   33   red
3   DD   44   red

In [211]:
df2.insert(3, 'colu', ['ok'])

ValueError: Length of values does not match length of index

In [74]:
df1.set_index(['name','age'], inplace=True)
df1

          gender
name age
AA   10        1
BB   22       23
CC   33       23
DD   44       32
EE   77       21

In [207]:
#df2.set_index(['name','age'], inplace=True)
print df2
df2.insert(2, 'cew', 'ok')

         color
name age
BB   22    red
AA   10    red
CC   33    red
DD   44    red

IndexError: index 2 is out of bounds for axis 0 with size 1

In [23]:
df = df1.join(df2, how='outer')
df.reset_index(inplace=True)
df.set_index(['name'], inplace=True)
df

NameError: name 'df2' is not defined

In [22]:
df.iloc[2]

NameError: name 'df' is not defined

In [193]:
df1

  name      age  gender
0   AA  10.2220       1
1   BB  22.3440      23
2   CC  33.4400      23
3   DD  44.3223      32
4   EE  77.3530      21

In [177]:
map(lambda x,y: x-y, df['age'], df['gender'])

[9, -1, 10, 12, 56]

In [170]:
filter(lambda x: x > 0, df.loc[df['age'] - df['gender']]>0)

KeyError: u'None of [name\nAA     9\nBB    -1\nCC    10\nDD    12\nEE    56\ndtype: int64] are in the [index]'

In [131]:
df.groupby('Group').filter(lambda x: x.loc[x.Mag.idxmin(), 'Morph'] == 'S')

TypeError: filter expected 2 arguments, got 1

In [128]:
ll = []
for i,r in df.iterrows():
    if r['age'] - r['position'] > 0:
        ll.append(pd.Series(r))
print ll

[age         22.0
gender      23.0
position     2.0
Name: BB, dtype: float64, age         44.0
gender      32.0
position    32.0
Name: DD, dtype: float64]

In [3]:
df.values

array([['AA', 10, 'F', nan],
       ['BB', 22, 'M', nan],
       ['CC', 33, 'M', nan],
       ['DD', 44, 'F', nan]], dtype=object)

In [4]:
# df.position = 'L1'
df.position = np.arange(4.)
df

  name  age gender  position
1   AA   10      F       0.0
2   BB   22      M       1.0
3   CC   33      M       2.0
4   DD   44      F       3.0

In [5]:
df.columns

Index([u'name', u'age', u'gender', u'position'], dtype='object')

In [98]:
df.gender[df.age > 20][df.gender == 'M'][df.position ==1.0]

2    M
Name: gender, dtype: object

In [15]:
df[['name','age']]

  name  age
0   AA   10
1   BB   22
2   CC   33
3   DD   44

In [8]:
df.ix[2]

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

name        BB
age         22
gender       M
position     1
Name: 2, dtype: object

In [179]:
ser1 = pd.Series([1.0,5.9,], index=[2,4])
df.position = ser1
df.index

Index([u'AA', u'BB', u'CC', u'DD', u'EE'], dtype='object', name=u'name')

In [10]:
df['NewCol'] = df.position == 1.0
df

  name  age gender  position  NewCol
1   AA   10      F       NaN   False
2   BB   22      M       1.0    True
3   CC   33      M       NaN   False
4   DD   44      F       5.9   False

In [11]:
del df['NewCol']

In [12]:
df2 = pd.DataFrame({
    'name' : {'fname' : 'sakshi', 'lname' : 'goyal'},
    'address' : {'line1' : 3, 'line2' : 4}
})
df2.T

          fname line1 line2  lname
address     NaN     3     4    NaN
name     sakshi   NaN   NaN  goyal

In [13]:
df3 = pd.DataFrame({
    'name' : df.name[0:3],
    'age' : df.age[:]
})
df3

   age name
1   10   AA
2   22   BB
3   33   CC
4   44  NaN

In [14]:
# set index and column name of dict inside dict type data frame
df2.index.name = 'name'
df2.columns.name = '<--->'
df2

<--->  address    name
name
fname      NaN  sakshi
line1      3.0     NaN
line2      4.0     NaN
lname      NaN   goyal

In [15]:
df2.values

array([[nan, 'sakshi'],
       [3.0, nan],
       [4.0, nan],
       [nan, 'goyal']], dtype=object)

In [16]:
# reindexing
df3.index.name = 'index'
df4 = df3.reindex([2, 4, 3, 8], fill_value = 0, method='ffill')
df4

       age name
index
2       22   BB
4       44  NaN
3       33   CC
8       44  NaN

In [215]:
df5 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['a', 'c', 'd', 'e'], columns = ['f1', 'f2','f3','f4'])
df5.index.name = 'ind'
df5

     f1  f2  f3  f4
ind
a     0   1   2   3
c     4   5   6   7
d     8   9  10  11
e    12  13  14  15

In [216]:
df5.drop(['c'])

     f1  f2  f3  f4
ind
a     0   1   2   3
d     8   9  10  11
e    12  13  14  15

In [217]:
df5.drop(['f2'], axis=1)

     f1  f3  f4
ind
a     0   2   3
c     4   6   7
d     8  10  11
e    12  14  15

In [218]:
df5[1:3]

     f1  f2  f3  f4
ind
c     4   5   6   7
d     8   9  10  11

In [219]:
df5['a':'d']

     f1  f2  f3  f4
ind
a     0   1   2   3
c     4   5   6   7
d     8   9  10  11

In [220]:
df5[:'a']

     f1  f2  f3  f4
ind
a     0   1   2   3

In [221]:
df5['c':'d'] = 8
df5

     f1  f2  f3  f4
ind
a     0   1   2   3
c     8   8   8   8
d     8   8   8   8
e    12  13  14  15

In [222]:
df5 < 7

        f1     f2     f3     f4
ind
a     True   True   True   True
c    False  False  False  False
d    False  False  False  False
e    False  False  False  False

In [223]:
df5.ix[df5.index > 'b', 'f1']     # number of columns to want

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

ind
c     8
d     8
e    12
Name: f1, dtype: int64

In [229]:
reind = pd.Series(['a','b','c','d',1,2,3,4])
df6 = df5.reindex(reind)
df6

    f1   f2   f3   f4
a  0.0  1.0  2.0  3.0
b  NaN  NaN  NaN  NaN
c  8.0  8.0  8.0  8.0
d  8.0  8.0  8.0  8.0
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [225]:
df6.ix[:'c', :3]

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    f1   f2   f3
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  8.0  8.0  8.0

In [226]:
df6.iloc[:df6.index.get_loc('c')+1, :3]

    f1   f2   f3
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  8.0  8.0  8.0

In [227]:
df6.loc[:'c', ['f1','f2']]

    f1   f2
a  0.0  1.0
b  NaN  NaN
c  8.0  8.0

In [133]:
df5

     f1  f2  f3  f4
ind
a     0   1   2   3
c     8   8   8   8
d     8   8   8   8
e    12  13  14  15

In [134]:
df6.applymap(lambda x : x ** 2)

     f1    f2    f3    f4
a   0.0   1.0   4.0   9.0
b   NaN   NaN   NaN   NaN
c  64.0  64.0  64.0  64.0
d  64.0  64.0  64.0  64.0
1   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN
3   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN

In [138]:
df5.f3 = df5.f3.astype(str) + 'T'
df5

     f1  f2   f3  f4
ind
a     0   1   2T   3
c     8   8   8T   8
d     8   8   8T   8
e    12  13  14T  15

In [144]:
df5[df5.f1 == 8]

     f1  f2  f3  f4
ind
c     8   8  8T   8
d     8   8  8T   8